MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU810/mcu.h
#define RPINR21 RPINR21
extern volatile uint16_t RPINR21 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR21BITS {
  union {
    struct {
      uint16_t SS1R:7;
    };
    struct {
      uint16_t SS1R0:1;
      uint16_t SS1R1:1;
      uint16_t SS1R2:1;
      uint16_t SS1R3:1;
      uint16_t SS1R4:1;
      uint16_t SS1R5:1;
      uint16_t SS1R6:1;
    };
  };
} RPINR21BITS;
extern volatile RPINR21BITS RPINR21bits __attribute__((__sfr__));

#define RPINR23 RPINR23
extern volatile uint16_t RPINR23 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR23BITS {
  union {
    struct {
      uint16_t SS2R:7;
    };
    struct {
      uint16_t SS2R0:1;
      uint16_t SS2R1:1;
      uint16_t SS2R2:1;
      uint16_t SS2R3:1;
      uint16_t SS2R4:1;
      uint16_t SS2R5:1;
      uint16_t SS2R6:1;
    };
  };
} RPINR23BITS;
extern volatile RPINR23BITS RPINR23bits __attribute__((__sfr__));

#define RPINR24 RPINR24
extern volatile uint16_t RPINR24 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR24BITS {
  union {
    struct {
      uint16_t CSDIR:7;
      uint16_t :1;
      uint16_t CSCKR:7;
    };
    struct {
      uint16_t CSDIR0:1;
      uint16_t CSDIR1:1;
      uint16_t CSDIR2:1;
      uint16_t CSDIR3:1;
      uint16_t CSDIR4:1;
      uint16_t CSDIR5:1;
      uint16_t CSDIR6:1;
      uint16_t :1;
      uint16_t CSCKR0:1;
      uint16_t CSCKR1:1;
      uint16_t CSCKR2:1;
      uint16_t CSCKR3:1;
      uint16_t CSCKR4:1;
      uint16_t CSCKR5:1;
      uint16_t CSCKR6:1;
    };
  };
} RPINR24BITS;
extern volatile RPINR24BITS RPINR24bits __attribute__((__sfr__));

#define RPINR25 RPINR25
extern volatile uint16_t RPINR25 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR25BITS {
  union {
    struct {
      uint16_t COFSR:7;
    };
    struct {
      uint16_t COFSR0:1;
      uint16_t COFSR1:1;
      uint16_t COFSR2:1;
      uint16_t COFSR3:1;
      uint16_t COFSR4:1;
      uint16_t COFSR5:1;
      uint16_t COFSR6:1;
    };
  };
} RPINR25BITS;
extern volatile RPINR25BITS RPINR25bits __attribute__((__sfr__));

#define RPINR26 RPINR26
extern volatile uint16_t RPINR26 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR26BITS {
  union {
    struct {
      uint16_t C1RXR:7;
      uint16_t :1;
      uint16_t C2RXR:7;
    };
    struct {
      uint16_t C1RXR0:1;
      uint16_t C1RXR1:1;
      uint16_t C1RXR2:1;
      uint16_t C1RXR3:1;
      uint16_t C1RXR4:1;
      uint16_t C1RXR5:1;
      uint16_t C1RXR6:1;
      uint16_t :1;
      uint16_t C2RXR0:1;
      uint16_t C2RXR1:1;
      uint16_t C2RXR2:1;
      uint16_t C2RXR3:1;
      uint16_t C2RXR4:1;
      uint16_t C2RXR5:1;
      uint16_t C2RXR6:1;
    };
  };
} RPINR26BITS;
extern volatile RPINR26BITS RPINR26bits __attribute__((__sfr__));

#define RPINR27 RPINR27
extern volatile uint16_t RPINR27 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR27BITS {
  union {
    struct {
      uint16_t U3RXR:7;
      uint16_t :1;
      uint16_t U3CTSR:7;
    };
    struct {
      uint16_t U3RXR0:1;
      uint16_t U3RXR1:1;
      uint16_t U3RXR2:1;
      uint16_t U3RXR3:1;
      uint16_t U3RXR4:1;
      uint16_t U3RXR5:1;
      uint16_t U3RXR6:1;
      uint16_t :1;
      uint16_t U3CTSR0:1;
      uint16_t U3CTSR1:1;
      uint16_t U3CTSR2:1;
      uint16_t U3CTSR3:1;
      uint16_t U3CTSR4:1;
      uint16_t U3CTSR5:1;
      uint16_t U3CTSR6:1;
    };
  };
} RPINR27BITS;
extern volatile RPINR27BITS RPINR27bits __attribute__((__sfr__));

#define RPINR28 RPINR28
extern volatile uint16_t RPINR28 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR28BITS {
  union {
    struct {
      uint16_t U4RXR:7;
      uint16_t :1;
      uint16_t U4CTSR:7;
    };
    struct {
      uint16_t U4RXR0:1;
      uint16_t U4RXR1:1;
      uint16_t U4RXR2:1;
      uint16_t U4RXR3:1;
      uint16_t U4RXR4:1;
      uint16_t U4RXR5:1;
      uint16_t U4RXR6:1;
      uint16_t :1;
      uint16_t U4CTSR0:1;
      uint16_t U4CTSR1:1;
      uint16_t U4CTSR2:1;
      uint16_t U4CTSR3:1;
      uint16_t U4CTSR4:1;
      uint16_t U4CTSR5:1;
      uint16_t U4CTSR6:1;
    };
  };
} RPINR28BITS;
extern volatile RPINR28BITS RPINR28bits __attribute__((__sfr__));

#define RPINR29 RPINR29
extern volatile uint16_t RPINR29 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR29BITS {
  union {
    struct {
      uint16_t SDI3R:7;
      uint16_t :1;
      uint16_t SCK3R:7;
    };
    struct {
      uint16_t SDI3R0:1;
      uint16_t SDI3R1:1;
      uint16_t SDI3R2:1;
      uint16_t SDI3R3:1;
      uint16_t SDI3R4:1;
      uint16_t SDI3R5:1;
      uint16_t SDI3R6:1;
      uint16_t :1;
      uint16_t SCK3R0:1;
      uint16_t SCK3R1:1;
      uint16_t SCK3R2:1;
      uint16_t SCK3R3:1;
      uint16_t SCK3R4:1;
      uint16_t SCK3R5:1;
      uint16_t SCK3R6:1;
    };
  };
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

#define RPINR30 RPINR30
extern volatile uint16_t RPINR30 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR30BITS {
  union {
    struct {
      uint16_t SS3R:7;
    };
    struct {
      uint16_t SS3R0:1;
      uint16_t SS3R1:1;
      uint16_t SS3R2:1;
      uint16_t SS3R3:1;
      uint16_t SS3R4:1;
      uint16_t SS3R5:1;
      uint16_t SS3R6:1;
    };
  };
} RPINR30BITS;
extern volatile RPINR30BITS RPINR30bits __attribute__((__sfr__));

#define RPINR31 RPINR31
extern volatile uint16_t RPINR31 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR31BITS {
  union {
    struct {
      uint16_t SDI4R:7;
      uint16_t :1;
      uint16_t SCK4R:7;
    };
    struct {
      uint16_t SDI4R0:1;
      uint16_t SDI4R1:1;
      uint16_t SDI4R2:1;
      uint16_t SDI4R3:1;
      uint16_t SDI4R4:1;
      uint16_t SDI4R5:1;
      uint16_t SDI4R6:1;
      uint16_t :1;
      uint16_t SCK4R0:1;
      uint16_t SCK4R1:1;
      uint16_t SCK4R2:1;
      uint16_t SCK4R3:1;
      uint16_t SCK4R4:1;
      uint16_t SCK4R5:1;
      uint16_t SCK4R6:1;
    };
  };
} RPINR31BITS;
extern volatile RPINR31BITS RPINR31bits __attribute__((__sfr__));

