MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU810/mcu.h
extern volatile REFOCONBITS REFOCONbits __attribute__((__sfr__));

#define ACLKCON3 ACLKCON3
extern volatile uint16_t ACLKCON3 __attribute__((__sfr__));
__extension__ typedef struct tagACLKCON3BITS {
  union {
    struct {
      uint16_t APLLPRE:3;
      uint16_t :2;
      uint16_t APLLPOST:3;
      uint16_t :1;
      uint16_t FRCSEL:1;
      uint16_t ASRCSEL:1;
      uint16_t AOSCMD:2;
      uint16_t SELACLK:1;
      uint16_t APLLCK:1;
      uint16_t ENAPLL:1;
    };
    struct {
      uint16_t APPLPRE0:1;
      uint16_t APPLPRE1:1;
      uint16_t APPLPRE2:1;
      uint16_t :2;
      uint16_t APLLPOST0:1;
      uint16_t APLLPOST1:1;
      uint16_t APLLPOST2:1;
      uint16_t :3;
      uint16_t AOSCMD0:1;
      uint16_t AOSCMD1:1;
    };
  };
} ACLKCON3BITS;
extern volatile ACLKCON3BITS ACLKCON3bits __attribute__((__sfr__));

#define ACLKDIV3 ACLKDIV3
extern volatile uint16_t ACLKDIV3 __attribute__((__sfr__));
__extension__ typedef struct tagACLKDIV3BITS {
  union {
    struct {
      uint16_t APLLDIV:3;
    };
    struct {
      uint16_t APLLDIV0:1;
      uint16_t APLLDIV1:1;
      uint16_t APLLDIV2:1;
    };
  };
} ACLKDIV3BITS;
extern volatile ACLKDIV3BITS ACLKDIV3bits __attribute__((__sfr__));

#define PMD1 PMD1
extern volatile uint16_t PMD1 __attribute__((__sfr__));
typedef struct tagPMD1BITS {
  uint16_t AD1MD:1;
  uint16_t C1MD:1;
  uint16_t C2MD:1;
  uint16_t SPI1MD:1;
  uint16_t SPI2MD:1;
  uint16_t U1MD:1;
  uint16_t U2MD:1;
  uint16_t I2C1MD:1;
  uint16_t DCIMD:1;
  uint16_t PWMMD:1;
  uint16_t QEI1MD:1;
  uint16_t T1MD:1;
  uint16_t T2MD:1;
  uint16_t T3MD:1;
  uint16_t T4MD:1;
  uint16_t T5MD:1;
} PMD1BITS;
extern volatile PMD1BITS PMD1bits __attribute__((__sfr__));

#define PMD2 PMD2
extern volatile uint16_t PMD2 __attribute__((__sfr__));
typedef struct tagPMD2BITS {
  uint16_t OC1MD:1;
  uint16_t OC2MD:1;
  uint16_t OC3MD:1;
  uint16_t OC4MD:1;
  uint16_t OC5MD:1;
  uint16_t OC6MD:1;
  uint16_t OC7MD:1;
  uint16_t OC8MD:1;
  uint16_t IC1MD:1;
  uint16_t IC2MD:1;
  uint16_t IC3MD:1;
  uint16_t IC4MD:1;
  uint16_t IC5MD:1;
  uint16_t IC6MD:1;
  uint16_t IC7MD:1;
  uint16_t IC8MD:1;
} PMD2BITS;
extern volatile PMD2BITS PMD2bits __attribute__((__sfr__));

#define PMD3 PMD3
extern volatile uint16_t PMD3 __attribute__((__sfr__));
typedef struct tagPMD3BITS {
  uint16_t AD2MD:1;
  uint16_t I2C2MD:1;
  uint16_t :1;
  uint16_t U3MD:1;
  uint16_t :1;
  uint16_t QEI2MD:1;
  uint16_t DAC1MD:1;
  uint16_t CRCMD:1;
  uint16_t PMPMD:1;
  uint16_t RTCCMD:1;
  uint16_t CMPMD:1;
  uint16_t :1;
  uint16_t T6MD:1;
  uint16_t T7MD:1;
  uint16_t T8MD:1;
  uint16_t T9MD:1;
} PMD3BITS;
extern volatile PMD3BITS PMD3bits __attribute__((__sfr__));

#define PMD4 PMD4
extern volatile uint16_t PMD4 __attribute__((__sfr__));
typedef struct tagPMD4BITS {
  uint16_t USB1MD:1;
  uint16_t :2;
  uint16_t REFOMD:1;
  uint16_t :1;
  uint16_t U4MD:1;
} PMD4BITS;
extern volatile PMD4BITS PMD4bits __attribute__((__sfr__));

#define PMD5 PMD5
extern volatile uint16_t PMD5 __attribute__((__sfr__));
typedef struct tagPMD5BITS {
  uint16_t OC9MD:1;
  uint16_t OC10MD:1;
  uint16_t OC11MD:1;
  uint16_t OC12MD:1;
  uint16_t OC13MD:1;
  uint16_t OC14MD:1;
  uint16_t OC15MD:1;
  uint16_t OC16MD:1;
  uint16_t IC9MD:1;
  uint16_t IC10MD:1;
  uint16_t IC11MD:1;
  uint16_t IC12MD:1;
  uint16_t IC13MD:1;
  uint16_t IC14MD:1;
  uint16_t IC15MD:1;
  uint16_t IC16MD:1;
} PMD5BITS;
extern volatile PMD5BITS PMD5bits __attribute__((__sfr__));

#define PMD6 PMD6
extern volatile uint16_t PMD6 __attribute__((__sfr__));
typedef struct tagPMD6BITS {
  uint16_t SPI3MD:1;
  uint16_t SPI4MD:1;
  uint16_t :6;
  uint16_t PWM1MD:1;
  uint16_t PWM2MD:1;
  uint16_t PWM3MD:1;
  uint16_t PWM4MD:1;
  uint16_t PWM5MD:1;
  uint16_t PWM6MD:1;
} PMD6BITS;
extern volatile PMD6BITS PMD6bits __attribute__((__sfr__));

#define PMD7 PMD7
extern volatile uint16_t PMD7 __attribute__((__sfr__));
__extension__ typedef struct tagPMD7BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t DMA0MD:1;
      uint16_t DMA4MD:1;
      uint16_t DMA8MD:1;
      uint16_t DMA12MD:1;
    };
    struct {
      uint16_t :4;
      uint16_t DMA1MD:1;
      uint16_t DMA5MD:1;
      uint16_t DMA9MD:1;
      uint16_t DMA13MD:1;
    };
    struct {
      uint16_t :4;
      uint16_t DMA2MD:1;
      uint16_t DMA6MD:1;
      uint16_t DMA10MD:1;
      uint16_t DMA14MD:1;
    };
    struct {
      uint16_t :4;
      uint16_t DMA3MD:1;
      uint16_t DMA7MD:1;
      uint16_t DMA11MD:1;
    };
  };
} PMD7BITS;
extern volatile PMD7BITS PMD7bits __attribute__((__sfr__));

#define IFS0 IFS0
extern volatile uint16_t IFS0 __attribute__((__sfr__));
typedef struct tagIFS0BITS {
  uint16_t INT0IF:1;
  uint16_t IC1IF:1;
  uint16_t OC1IF:1;
  uint16_t T1IF:1;
  uint16_t DMA0IF:1;
  uint16_t IC2IF:1;
  uint16_t OC2IF:1;
  uint16_t T2IF:1;
  uint16_t T3IF:1;
  uint16_t SPI1EIF:1;
  uint16_t SPI1IF:1;
  uint16_t U1RXIF:1;
  uint16_t U1TXIF:1;
  uint16_t AD1IF:1;
  uint16_t DMA1IF:1;
  uint16_t NVMIF:1;
} IFS0BITS;
extern volatile IFS0BITS IFS0bits __attribute__((__sfr__));

#define IFS1 IFS1
extern volatile uint16_t IFS1 __attribute__((__sfr__));
typedef struct tagIFS1BITS {
  uint16_t SI2C1IF:1;
  uint16_t MI2C1IF:1;
  uint16_t CMIF:1;
  uint16_t CNIF:1;
  uint16_t INT1IF:1;
  uint16_t AD2IF:1;
  uint16_t IC7IF:1;
  uint16_t IC8IF:1;
  uint16_t DMA2IF:1;
  uint16_t OC3IF:1;
  uint16_t OC4IF:1;
  uint16_t T4IF:1;
  uint16_t T5IF:1;
  uint16_t INT2IF:1;
  uint16_t U2RXIF:1;
  uint16_t U2TXIF:1;
} IFS1BITS;
extern volatile IFS1BITS IFS1bits __attribute__((__sfr__));

#define IFS2 IFS2
extern volatile uint16_t IFS2 __attribute__((__sfr__));
typedef struct tagIFS2BITS {
  uint16_t SPI2EIF:1;
  uint16_t SPI2IF:1;
  uint16_t C1RXIF:1;
  uint16_t C1IF:1;
  uint16_t DMA3IF:1;
  uint16_t IC3IF:1;
  uint16_t IC4IF:1;
  uint16_t IC5IF:1;
  uint16_t IC6IF:1;
  uint16_t OC5IF:1;
  uint16_t OC6IF:1;
  uint16_t OC7IF:1;
  uint16_t OC8IF:1;
  uint16_t PMPIF:1;
  uint16_t DMA4IF:1;
  uint16_t T6IF:1;
} IFS2BITS;
extern volatile IFS2BITS IFS2bits __attribute__((__sfr__));

#define IFS3 IFS3
extern volatile uint16_t IFS3 __attribute__((__sfr__));
typedef struct tagIFS3BITS {
  uint16_t T7IF:1;
  uint16_t SI2C2IF:1;
  uint16_t MI2C2IF:1;
  uint16_t T8IF:1;
  uint16_t T9IF:1;
  uint16_t INT3IF:1;
  uint16_t INT4IF:1;
  uint16_t C2RXIF:1;
  uint16_t C2IF:1;
  uint16_t PSEMIF:1;
  uint16_t QEI1IF:1;
  uint16_t DCIEIF:1;
  uint16_t DCIIF:1;
  uint16_t DMA5IF:1;
  uint16_t RTCIF:1;
} IFS3BITS;
extern volatile IFS3BITS IFS3bits __attribute__((__sfr__));

#define IFS4 IFS4
extern volatile uint16_t IFS4 __attribute__((__sfr__));
typedef struct tagIFS4BITS {
  uint16_t :1;
  uint16_t U1EIF:1;
  uint16_t U2EIF:1;
  uint16_t CRCIF:1;
  uint16_t DMA6IF:1;
  uint16_t DMA7IF:1;
  uint16_t C1TXIF:1;
  uint16_t C2TXIF:1;
  uint16_t :1;
  uint16_t PSESMIF:1;
  uint16_t :1;
  uint16_t QEI2IF:1;
} IFS4BITS;
extern volatile IFS4BITS IFS4bits __attribute__((__sfr__));

#define IFS5 IFS5
extern volatile uint16_t IFS5 __attribute__((__sfr__));
typedef struct tagIFS5BITS {
  uint16_t :1;
  uint16_t U3EIF:1;
  uint16_t U3RXIF:1;
  uint16_t U3TXIF:1;
  uint16_t :2;
  uint16_t USB1IF:1;
  uint16_t U4EIF:1;
  uint16_t U4RXIF:1;
  uint16_t U4TXIF:1;
  uint16_t SPI3EIF:1;
  uint16_t SPI3IF:1;
  uint16_t OC9IF:1;
  uint16_t IC9IF:1;
  uint16_t PWM1IF:1;
  uint16_t PWM2IF:1;
} IFS5BITS;
extern volatile IFS5BITS IFS5bits __attribute__((__sfr__));

#define IFS6 IFS6
extern volatile uint16_t IFS6 __attribute__((__sfr__));
typedef struct tagIFS6BITS {
  uint16_t PWM3IF:1;
  uint16_t PWM4IF:1;
  uint16_t PWM5IF:1;
  uint16_t PWM6IF:1;
} IFS6BITS;
extern volatile IFS6BITS IFS6bits __attribute__((__sfr__));

#define IFS7 IFS7
extern volatile uint16_t IFS7 __attribute__((__sfr__));
typedef struct tagIFS7BITS {
  uint16_t :6;
  uint16_t DMA8IF:1;
  uint16_t DMA9IF:1;
  uint16_t DMA10IF:1;
  uint16_t DMA11IF:1;
  uint16_t SPI4EIF:1;
  uint16_t SPI4IF:1;
  uint16_t OC10IF:1;
  uint16_t IC10IF:1;
  uint16_t OC11IF:1;
  uint16_t IC11IF:1;
} IFS7BITS;
