MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU810/mcu.h
extern volatile DMA4REQBITS DMA4REQbits __attribute__((__sfr__));

#define DMA4STAL DMA4STAL
extern volatile uint16_t DMA4STAL __attribute__((__sfr__));
#define DMA4STAH DMA4STAH
extern volatile uint16_t DMA4STAH __attribute__((__sfr__));
typedef struct tagDMA4STAHBITS {
  uint16_t STA:8;
} DMA4STAHBITS;
extern volatile DMA4STAHBITS DMA4STAHbits __attribute__((__sfr__));

#define DMA4STBL DMA4STBL
extern volatile uint16_t DMA4STBL __attribute__((__sfr__));
#define DMA4STBH DMA4STBH
extern volatile uint16_t DMA4STBH __attribute__((__sfr__));
typedef struct tagDMA4STBHBITS {
  uint16_t STB:8;
} DMA4STBHBITS;
extern volatile DMA4STBHBITS DMA4STBHbits __attribute__((__sfr__));

#define DMA4PAD DMA4PAD
extern volatile uint16_t DMA4PAD __attribute__((__sfr__));
#define DMA4CNT DMA4CNT
extern volatile uint16_t DMA4CNT __attribute__((__sfr__));
typedef struct tagDMA4CNTBITS {
  uint16_t CNT:14;
} DMA4CNTBITS;
extern volatile DMA4CNTBITS DMA4CNTbits __attribute__((__sfr__));

#define DMA5CON DMA5CON
extern volatile uint16_t DMA5CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA5CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA5CONBITS;
extern volatile DMA5CONBITS DMA5CONbits __attribute__((__sfr__));

#define DMA5REQ DMA5REQ
extern volatile uint16_t DMA5REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA5REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA5REQBITS;
extern volatile DMA5REQBITS DMA5REQbits __attribute__((__sfr__));

#define DMA5STAL DMA5STAL
extern volatile uint16_t DMA5STAL __attribute__((__sfr__));
#define DMA5STAH DMA5STAH
extern volatile uint16_t DMA5STAH __attribute__((__sfr__));
typedef struct tagDMA5STAHBITS {
  uint16_t STA:8;
} DMA5STAHBITS;
extern volatile DMA5STAHBITS DMA5STAHbits __attribute__((__sfr__));

#define DMA5STBL DMA5STBL
extern volatile uint16_t DMA5STBL __attribute__((__sfr__));
#define DMA5STBH DMA5STBH
extern volatile uint16_t DMA5STBH __attribute__((__sfr__));
typedef struct tagDMA5STBHBITS {
  uint16_t STB:8;
} DMA5STBHBITS;
extern volatile DMA5STBHBITS DMA5STBHbits __attribute__((__sfr__));

#define DMA5PAD DMA5PAD
extern volatile uint16_t DMA5PAD __attribute__((__sfr__));
#define DMA5CNT DMA5CNT
extern volatile uint16_t DMA5CNT __attribute__((__sfr__));
typedef struct tagDMA5CNTBITS {
  uint16_t CNT:14;
} DMA5CNTBITS;
extern volatile DMA5CNTBITS DMA5CNTbits __attribute__((__sfr__));

#define DMA6CON DMA6CON
extern volatile uint16_t DMA6CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA6CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA6CONBITS;
extern volatile DMA6CONBITS DMA6CONbits __attribute__((__sfr__));

#define DMA6REQ DMA6REQ
extern volatile uint16_t DMA6REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA6REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA6REQBITS;
extern volatile DMA6REQBITS DMA6REQbits __attribute__((__sfr__));

#define DMA6STAL DMA6STAL
extern volatile uint16_t DMA6STAL __attribute__((__sfr__));
#define DMA6STAH DMA6STAH
extern volatile uint16_t DMA6STAH __attribute__((__sfr__));
typedef struct tagDMA6STAHBITS {
  uint16_t STA:8;
} DMA6STAHBITS;
extern volatile DMA6STAHBITS DMA6STAHbits __attribute__((__sfr__));

#define DMA6STBL DMA6STBL
extern volatile uint16_t DMA6STBL __attribute__((__sfr__));
#define DMA6STBH DMA6STBH
extern volatile uint16_t DMA6STBH __attribute__((__sfr__));
typedef struct tagDMA6STBHBITS {
  uint16_t STB:8;
} DMA6STBHBITS;
extern volatile DMA6STBHBITS DMA6STBHbits __attribute__((__sfr__));

#define DMA6PAD DMA6PAD
extern volatile uint16_t DMA6PAD __attribute__((__sfr__));
#define DMA6CNT DMA6CNT
extern volatile uint16_t DMA6CNT __attribute__((__sfr__));
typedef struct tagDMA6CNTBITS {
  uint16_t CNT:14;
} DMA6CNTBITS;
extern volatile DMA6CNTBITS DMA6CNTbits __attribute__((__sfr__));

#define DMA7CON DMA7CON
extern volatile uint16_t DMA7CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA7CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA7CONBITS;
extern volatile DMA7CONBITS DMA7CONbits __attribute__((__sfr__));

#define DMA7REQ DMA7REQ
extern volatile uint16_t DMA7REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA7REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA7REQBITS;
extern volatile DMA7REQBITS DMA7REQbits __attribute__((__sfr__));

#define DMA7STAL DMA7STAL
extern volatile uint16_t DMA7STAL __attribute__((__sfr__));
#define DMA7STAH DMA7STAH
extern volatile uint16_t DMA7STAH __attribute__((__sfr__));
typedef struct tagDMA7STAHBITS {
  uint16_t STA:8;
} DMA7STAHBITS;
extern volatile DMA7STAHBITS DMA7STAHbits __attribute__((__sfr__));

#define DMA7STBL DMA7STBL
extern volatile uint16_t DMA7STBL __attribute__((__sfr__));
#define DMA7STBH DMA7STBH
extern volatile uint16_t DMA7STBH __attribute__((__sfr__));
typedef struct tagDMA7STBHBITS {
  uint16_t STB:8;
} DMA7STBHBITS;
