MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU810/mcu.h
/* SPI4CON1 */
/* Bitname _PPRE cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _PPRE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PPRE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE0 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SPRE2 cannot be defined because it is used by more than one SFR */

/* SPI4CON2 */
/* Bitname _SPIBEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMDLY cannot be defined because it is used by more than one SFR */
/* Bitname _FRMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFSD cannot be defined because it is used by more than one SFR */
/* Bitname _FRMEN cannot be defined because it is used by more than one SFR */

/* AD1CON1 */
#define _DONE AD1CON1bits.DONE
#define _SAMP AD1CON1bits.SAMP
#define _ASAM AD1CON1bits.ASAM
#define _SIMSAM AD1CON1bits.SIMSAM
#define _SSRCG AD1CON1bits.SSRCG
#define _SSRC AD1CON1bits.SSRC
#define _FORM AD1CON1bits.FORM
#define _AD12B AD1CON1bits.AD12B
#define _ADDMABM AD1CON1bits.ADDMABM
#define _ADSIDL AD1CON1bits.ADSIDL
#define _ADON AD1CON1bits.ADON
#define _SSRC0 AD1CON1bits.SSRC0
#define _SSRC1 AD1CON1bits.SSRC1
#define _SSRC2 AD1CON1bits.SSRC2
#define _FORM0 AD1CON1bits.FORM0
#define _FORM1 AD1CON1bits.FORM1

/* AD1CON2 */
#define _ALTS AD1CON2bits.ALTS
#define _BUFM AD1CON2bits.BUFM
#define _SMPI AD1CON2bits.SMPI
#define _BUFS AD1CON2bits.BUFS
#define _CHPS AD1CON2bits.CHPS
#define _CSCNA AD1CON2bits.CSCNA
#define _VCFG AD1CON2bits.VCFG
#define _SMPI0 AD1CON2bits.SMPI0
#define _SMPI1 AD1CON2bits.SMPI1
#define _SMPI2 AD1CON2bits.SMPI2
#define _SMPI3 AD1CON2bits.SMPI3
#define _SMPI4 AD1CON2bits.SMPI4
#define _CHPS0 AD1CON2bits.CHPS0
#define _CHPS1 AD1CON2bits.CHPS1
#define _VCFG0 AD1CON2bits.VCFG0
#define _VCFG1 AD1CON2bits.VCFG1
#define _VCFG2 AD1CON2bits.VCFG2

/* AD1CON3 */
#define _ADCS AD1CON3bits.ADCS
#define _SAMC AD1CON3bits.SAMC
#define _ADRC AD1CON3bits.ADRC
#define _ADCS0 AD1CON3bits.ADCS0
#define _ADCS1 AD1CON3bits.ADCS1
#define _ADCS2 AD1CON3bits.ADCS2
#define _ADCS3 AD1CON3bits.ADCS3
#define _ADCS4 AD1CON3bits.ADCS4
#define _ADCS5 AD1CON3bits.ADCS5
#define _ADCS6 AD1CON3bits.ADCS6
#define _ADCS7 AD1CON3bits.ADCS7
#define _SAMC0 AD1CON3bits.SAMC0
#define _SAMC1 AD1CON3bits.SAMC1
#define _SAMC2 AD1CON3bits.SAMC2
#define _SAMC3 AD1CON3bits.SAMC3
#define _SAMC4 AD1CON3bits.SAMC4

/* AD1CHS123 */
#define _CH123SA AD1CHS123bits.CH123SA
#define _CH123NA AD1CHS123bits.CH123NA
#define _CH123SB AD1CHS123bits.CH123SB
#define _CH123NB AD1CHS123bits.CH123NB
#define _CH123NA0 AD1CHS123bits.CH123NA0
#define _CH123NA1 AD1CHS123bits.CH123NA1
#define _CH123NB0 AD1CHS123bits.CH123NB0
#define _CH123NB1 AD1CHS123bits.CH123NB1

/* AD1CHS0 */
#define _CH0SA AD1CHS0bits.CH0SA
#define _CH0NA AD1CHS0bits.CH0NA
#define _CH0SB AD1CHS0bits.CH0SB
#define _CH0NB AD1CHS0bits.CH0NB
#define _CH0SA0 AD1CHS0bits.CH0SA0
#define _CH0SA1 AD1CHS0bits.CH0SA1
#define _CH0SA2 AD1CHS0bits.CH0SA2
#define _CH0SA3 AD1CHS0bits.CH0SA3
#define _CH0SA4 AD1CHS0bits.CH0SA4
#define _CH0SB0 AD1CHS0bits.CH0SB0
#define _CH0SB1 AD1CHS0bits.CH0SB1
#define _CH0SB2 AD1CHS0bits.CH0SB2
#define _CH0SB3 AD1CHS0bits.CH0SB3
#define _CH0SB4 AD1CHS0bits.CH0SB4

/* AD1CSSH */
#define _CSS16 AD1CSSHbits.CSS16
#define _CSS17 AD1CSSHbits.CSS17
#define _CSS18 AD1CSSHbits.CSS18
#define _CSS19 AD1CSSHbits.CSS19
#define _CSS20 AD1CSSHbits.CSS20
#define _CSS21 AD1CSSHbits.CSS21
#define _CSS22 AD1CSSHbits.CSS22
#define _CSS23 AD1CSSHbits.CSS23
#define _CSS24 AD1CSSHbits.CSS24
#define _CSS25 AD1CSSHbits.CSS25
#define _CSS26 AD1CSSHbits.CSS26
#define _CSS27 AD1CSSHbits.CSS27
#define _CSS28 AD1CSSHbits.CSS28
#define _CSS29 AD1CSSHbits.CSS29
#define _CSS30 AD1CSSHbits.CSS30
#define _CSS31 AD1CSSHbits.CSS31

/* AD1CSSL */
#define _CSS0 AD1CSSLbits.CSS0
#define _CSS1 AD1CSSLbits.CSS1
#define _CSS2 AD1CSSLbits.CSS2
#define _CSS3 AD1CSSLbits.CSS3
#define _CSS4 AD1CSSLbits.CSS4
#define _CSS5 AD1CSSLbits.CSS5
#define _CSS6 AD1CSSLbits.CSS6
#define _CSS7 AD1CSSLbits.CSS7
#define _CSS8 AD1CSSLbits.CSS8
#define _CSS9 AD1CSSLbits.CSS9
#define _CSS10 AD1CSSLbits.CSS10
#define _CSS11 AD1CSSLbits.CSS11
#define _CSS12 AD1CSSLbits.CSS12
#define _CSS13 AD1CSSLbits.CSS13
#define _CSS14 AD1CSSLbits.CSS14
#define _CSS15 AD1CSSLbits.CSS15

/* AD1CON4 */
#define _DMABL AD1CON4bits.DMABL
#define _ADDMAEN AD1CON4bits.ADDMAEN
#define _DMABL0 AD1CON4bits.DMABL0
#define _DMABL1 AD1CON4bits.DMABL1
#define _DMABL2 AD1CON4bits.DMABL2

/* AD2CON1 */
/* Bitname _DONE cannot be defined because it is used by more than one SFR */
/* Bitname _SAMP cannot be defined because it is used by more than one SFR */
/* Bitname _ASAM cannot be defined because it is used by more than one SFR */
/* Bitname _SIMSAM cannot be defined because it is used by more than one SFR */
/* Bitname _SSRCG cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC cannot be defined because it is used by more than one SFR */
/* Bitname _FORM cannot be defined because it is used by more than one SFR */
/* Bitname _ADDMABM cannot be defined because it is used by more than one SFR */
/* Bitname _ADSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _ADON cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SSRC2 cannot be defined because it is used by more than one SFR */
/* Bitname _FORM0 cannot be defined because it is used by more than one SFR */
/* Bitname _FORM1 cannot be defined because it is used by more than one SFR */

/* AD2CON2 */
/* Bitname _ALTS cannot be defined because it is used by more than one SFR */
/* Bitname _BUFM cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI cannot be defined because it is used by more than one SFR */
/* Bitname _BUFS cannot be defined because it is used by more than one SFR */
/* Bitname _CHPS cannot be defined because it is used by more than one SFR */
/* Bitname _CSCNA cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI0 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI1 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI2 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI3 cannot be defined because it is used by more than one SFR */
/* Bitname _SMPI4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHPS0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHPS1 cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG0 cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG1 cannot be defined because it is used by more than one SFR */
/* Bitname _VCFG2 cannot be defined because it is used by more than one SFR */

/* AD2CON3 */
/* Bitname _ADCS cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _ADRC cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADCS7 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */

/* AD2CHS123 */
/* Bitname _CH123SA cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NA cannot be defined because it is used by more than one SFR */
/* Bitname _CH123SB cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NB cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NA0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NA1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NB0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH123NB1 cannot be defined because it is used by more than one SFR */

/* AD2CHS0 */
/* Bitname _CH0SA cannot be defined because it is used by more than one SFR */
/* Bitname _CH0NA cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB cannot be defined because it is used by more than one SFR */
/* Bitname _CH0NB cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA2 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA3 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SA4 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB0 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB1 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB2 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB3 cannot be defined because it is used by more than one SFR */
/* Bitname _CH0SB4 cannot be defined because it is used by more than one SFR */

/* AD2CSSL */
/* Bitname _CSS0 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS1 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS2 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS3 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS4 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS5 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS6 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS7 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS8 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS9 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS10 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS11 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS12 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS13 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS14 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS15 cannot be defined because it is used by more than one SFR */

/* AD2CON4 */
/* Bitname _DMABL cannot be defined because it is used by more than one SFR */
/* Bitname _ADDMAEN cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL2 cannot be defined because it is used by more than one SFR */

/* C1CTRL1 */
/* Bitname _WIN cannot be defined because it is used by more than one SFR */
/* Bitname _CANCAP cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP cannot be defined because it is used by more than one SFR */
/* Bitname _CANCKS cannot be defined because it is used by more than one SFR */
/* Bitname _ABAT cannot be defined because it is used by more than one SFR */
/* Bitname _CSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _OPMODE2 cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP0 cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP1 cannot be defined because it is used by more than one SFR */
/* Bitname _REQOP2 cannot be defined because it is used by more than one SFR */

/* C1CTRL2 */
/* Bitname _DNCNT cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT0 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT1 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT2 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT3 cannot be defined because it is used by more than one SFR */
/* Bitname _DNCNT4 cannot be defined because it is used by more than one SFR */

/* C1VEC */
/* Bitname _ICODE cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE2 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE3 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE4 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE5 cannot be defined because it is used by more than one SFR */
/* Bitname _ICODE6 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT0 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT2 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT3 cannot be defined because it is used by more than one SFR */
/* Bitname _FILHIT4 cannot be defined because it is used by more than one SFR */

/* C1FCTRL */
/* Bitname _FSA cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS cannot be defined because it is used by more than one SFR */
/* Bitname _FSA0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSA4 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS0 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS1 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABS2 cannot be defined because it is used by more than one SFR */

