MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU810/mcu.h
#define _C2TR23CON_TXEN3_POSITION                0x0000000F
#define _C2TR23CON_TXEN3_MASK                    0x00008000
#define _C2TR23CON_TXEN3_LENGTH                  0x00000001

#define _C2TR23CON_TX2PRI0_POSITION              0x00000000
#define _C2TR23CON_TX2PRI0_MASK                  0x00000001
#define _C2TR23CON_TX2PRI0_LENGTH                0x00000001

#define _C2TR23CON_TX2PRI1_POSITION              0x00000001
#define _C2TR23CON_TX2PRI1_MASK                  0x00000002
#define _C2TR23CON_TX2PRI1_LENGTH                0x00000001

#define _C2TR23CON_TX3PRI0_POSITION              0x00000008
#define _C2TR23CON_TX3PRI0_MASK                  0x00000100
#define _C2TR23CON_TX3PRI0_LENGTH                0x00000001

#define _C2TR23CON_TX3PRI1_POSITION              0x00000009
#define _C2TR23CON_TX3PRI1_MASK                  0x00000200
#define _C2TR23CON_TX3PRI1_LENGTH                0x00000001

#define _C2RXM1SID_EID16_POSITION                0x00000000
#define _C2RXM1SID_EID16_MASK                    0x00000001
#define _C2RXM1SID_EID16_LENGTH                  0x00000001

#define _C2RXM1SID_EID17_POSITION                0x00000001
#define _C2RXM1SID_EID17_MASK                    0x00000002
#define _C2RXM1SID_EID17_LENGTH                  0x00000001

#define _C2RXM1SID_MIDE_POSITION                 0x00000003
#define _C2RXM1SID_MIDE_MASK                     0x00000008
#define _C2RXM1SID_MIDE_LENGTH                   0x00000001

#define _C2RXM1SID_SID0_POSITION                 0x00000005
#define _C2RXM1SID_SID0_MASK                     0x00000020
#define _C2RXM1SID_SID0_LENGTH                   0x00000001

#define _C2RXM1SID_SID1_POSITION                 0x00000006
#define _C2RXM1SID_SID1_MASK                     0x00000040
#define _C2RXM1SID_SID1_LENGTH                   0x00000001

#define _C2RXM1SID_SID2_POSITION                 0x00000007
#define _C2RXM1SID_SID2_MASK                     0x00000080
#define _C2RXM1SID_SID2_LENGTH                   0x00000001

#define _C2RXM1SID_SID3_POSITION                 0x00000008
#define _C2RXM1SID_SID3_MASK                     0x00000100
#define _C2RXM1SID_SID3_LENGTH                   0x00000001

#define _C2RXM1SID_SID4_POSITION                 0x00000009
#define _C2RXM1SID_SID4_MASK                     0x00000200
#define _C2RXM1SID_SID4_LENGTH                   0x00000001

#define _C2RXM1SID_SID5_POSITION                 0x0000000A
#define _C2RXM1SID_SID5_MASK                     0x00000400
#define _C2RXM1SID_SID5_LENGTH                   0x00000001

#define _C2RXM1SID_SID6_POSITION                 0x0000000B
#define _C2RXM1SID_SID6_MASK                     0x00000800
#define _C2RXM1SID_SID6_LENGTH                   0x00000001

#define _C2RXM1SID_SID7_POSITION                 0x0000000C
#define _C2RXM1SID_SID7_MASK                     0x00001000
#define _C2RXM1SID_SID7_LENGTH                   0x00000001

#define _C2RXM1SID_SID8_POSITION                 0x0000000D
#define _C2RXM1SID_SID8_MASK                     0x00002000
#define _C2RXM1SID_SID8_LENGTH                   0x00000001

#define _C2RXM1SID_SID9_POSITION                 0x0000000E
#define _C2RXM1SID_SID9_MASK                     0x00004000
#define _C2RXM1SID_SID9_LENGTH                   0x00000001

#define _C2RXM1SID_SID10_POSITION                0x0000000F
#define _C2RXM1SID_SID10_MASK                    0x00008000
#define _C2RXM1SID_SID10_LENGTH                  0x00000001

#define _C2RXM1SID_EID_POSITION                  0x00000000
#define _C2RXM1SID_EID_MASK                      0x00000003
#define _C2RXM1SID_EID_LENGTH                    0x00000002

#define _C2RXM1SID_SID_POSITION                  0x00000005
#define _C2RXM1SID_SID_MASK                      0x0000FFE0
#define _C2RXM1SID_SID_LENGTH                    0x0000000B

#define _C2TR45CON_TX4PRI_POSITION               0x00000000
#define _C2TR45CON_TX4PRI_MASK                   0x00000003
#define _C2TR45CON_TX4PRI_LENGTH                 0x00000002

#define _C2TR45CON_RTREN4_POSITION               0x00000002
#define _C2TR45CON_RTREN4_MASK                   0x00000004
#define _C2TR45CON_RTREN4_LENGTH                 0x00000001

#define _C2TR45CON_TXREQ4_POSITION               0x00000003
#define _C2TR45CON_TXREQ4_MASK                   0x00000008
#define _C2TR45CON_TXREQ4_LENGTH                 0x00000001

#define _C2TR45CON_TXERR4_POSITION               0x00000004
#define _C2TR45CON_TXERR4_MASK                   0x00000010
#define _C2TR45CON_TXERR4_LENGTH                 0x00000001

#define _C2TR45CON_TXLARB4_POSITION              0x00000005
#define _C2TR45CON_TXLARB4_MASK                  0x00000020
#define _C2TR45CON_TXLARB4_LENGTH                0x00000001

#define _C2TR45CON_TXABT4_POSITION               0x00000006
#define _C2TR45CON_TXABT4_MASK                   0x00000040
#define _C2TR45CON_TXABT4_LENGTH                 0x00000001

#define _C2TR45CON_TXEN4_POSITION                0x00000007
#define _C2TR45CON_TXEN4_MASK                    0x00000080
#define _C2TR45CON_TXEN4_LENGTH                  0x00000001

#define _C2TR45CON_TX5PRI_POSITION               0x00000008
#define _C2TR45CON_TX5PRI_MASK                   0x00000300
#define _C2TR45CON_TX5PRI_LENGTH                 0x00000002

#define _C2TR45CON_RTREN5_POSITION               0x0000000A
#define _C2TR45CON_RTREN5_MASK                   0x00000400
#define _C2TR45CON_RTREN5_LENGTH                 0x00000001

#define _C2TR45CON_TXREQ5_POSITION               0x0000000B
#define _C2TR45CON_TXREQ5_MASK                   0x00000800
#define _C2TR45CON_TXREQ5_LENGTH                 0x00000001

#define _C2TR45CON_TXERR5_POSITION               0x0000000C
#define _C2TR45CON_TXERR5_MASK                   0x00001000
#define _C2TR45CON_TXERR5_LENGTH                 0x00000001

#define _C2TR45CON_TXLARB5_POSITION              0x0000000D
#define _C2TR45CON_TXLARB5_MASK                  0x00002000
#define _C2TR45CON_TXLARB5_LENGTH                0x00000001

#define _C2TR45CON_TXABT5_POSITION               0x0000000E
#define _C2TR45CON_TXABT5_MASK                   0x00004000
#define _C2TR45CON_TXABT5_LENGTH                 0x00000001

#define _C2TR45CON_TXEN5_POSITION                0x0000000F
#define _C2TR45CON_TXEN5_MASK                    0x00008000
#define _C2TR45CON_TXEN5_LENGTH                  0x00000001

#define _C2TR45CON_TX4PRI0_POSITION              0x00000000
#define _C2TR45CON_TX4PRI0_MASK                  0x00000001
#define _C2TR45CON_TX4PRI0_LENGTH                0x00000001

#define _C2TR45CON_TX4PRI1_POSITION              0x00000001
#define _C2TR45CON_TX4PRI1_MASK                  0x00000002
#define _C2TR45CON_TX4PRI1_LENGTH                0x00000001

#define _C2TR45CON_TX5PRI0_POSITION              0x00000008
#define _C2TR45CON_TX5PRI0_MASK                  0x00000100
#define _C2TR45CON_TX5PRI0_LENGTH                0x00000001

#define _C2TR45CON_TX5PRI1_POSITION              0x00000009
#define _C2TR45CON_TX5PRI1_MASK                  0x00000200
#define _C2TR45CON_TX5PRI1_LENGTH                0x00000001

#define _C2RXM1EID_EID0_POSITION                 0x00000000
#define _C2RXM1EID_EID0_MASK                     0x00000001
#define _C2RXM1EID_EID0_LENGTH                   0x00000001

#define _C2RXM1EID_EID1_POSITION                 0x00000001
#define _C2RXM1EID_EID1_MASK                     0x00000002
#define _C2RXM1EID_EID1_LENGTH                   0x00000001

#define _C2RXM1EID_EID2_POSITION                 0x00000002
#define _C2RXM1EID_EID2_MASK                     0x00000004
#define _C2RXM1EID_EID2_LENGTH                   0x00000001

