MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU810/mcu.h
#define _IFS4_C2TXIF_POSITION                    0x00000007
#define _IFS4_C2TXIF_MASK                        0x00000080
#define _IFS4_C2TXIF_LENGTH                      0x00000001

#define _IFS4_PSESMIF_POSITION                   0x00000009
#define _IFS4_PSESMIF_MASK                       0x00000200
#define _IFS4_PSESMIF_LENGTH                     0x00000001

#define _IFS4_QEI2IF_POSITION                    0x0000000B
#define _IFS4_QEI2IF_MASK                        0x00000800
#define _IFS4_QEI2IF_LENGTH                      0x00000001

#define _IFS5_U3EIF_POSITION                     0x00000001
#define _IFS5_U3EIF_MASK                         0x00000002
#define _IFS5_U3EIF_LENGTH                       0x00000001

#define _IFS5_U3RXIF_POSITION                    0x00000002
#define _IFS5_U3RXIF_MASK                        0x00000004
#define _IFS5_U3RXIF_LENGTH                      0x00000001

#define _IFS5_U3TXIF_POSITION                    0x00000003
#define _IFS5_U3TXIF_MASK                        0x00000008
#define _IFS5_U3TXIF_LENGTH                      0x00000001

#define _IFS5_USB1IF_POSITION                    0x00000006
#define _IFS5_USB1IF_MASK                        0x00000040
#define _IFS5_USB1IF_LENGTH                      0x00000001

#define _IFS5_U4EIF_POSITION                     0x00000007
#define _IFS5_U4EIF_MASK                         0x00000080
#define _IFS5_U4EIF_LENGTH                       0x00000001

#define _IFS5_U4RXIF_POSITION                    0x00000008
#define _IFS5_U4RXIF_MASK                        0x00000100
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x00000009
#define _IFS5_U4TXIF_MASK                        0x00000200
#define _IFS5_U4TXIF_LENGTH                      0x00000001

#define _IFS5_SPI3EIF_POSITION                   0x0000000A
#define _IFS5_SPI3EIF_MASK                       0x00000400
#define _IFS5_SPI3EIF_LENGTH                     0x00000001

#define _IFS5_SPI3IF_POSITION                    0x0000000B
#define _IFS5_SPI3IF_MASK                        0x00000800
#define _IFS5_SPI3IF_LENGTH                      0x00000001

#define _IFS5_OC9IF_POSITION                     0x0000000C
#define _IFS5_OC9IF_MASK                         0x00001000
#define _IFS5_OC9IF_LENGTH                       0x00000001

#define _IFS5_IC9IF_POSITION                     0x0000000D
#define _IFS5_IC9IF_MASK                         0x00002000
#define _IFS5_IC9IF_LENGTH                       0x00000001

#define _IFS5_PWM1IF_POSITION                    0x0000000E
#define _IFS5_PWM1IF_MASK                        0x00004000
#define _IFS5_PWM1IF_LENGTH                      0x00000001

#define _IFS5_PWM2IF_POSITION                    0x0000000F
#define _IFS5_PWM2IF_MASK                        0x00008000
#define _IFS5_PWM2IF_LENGTH                      0x00000001

#define _IFS6_PWM3IF_POSITION                    0x00000000
#define _IFS6_PWM3IF_MASK                        0x00000001
#define _IFS6_PWM3IF_LENGTH                      0x00000001

#define _IFS6_PWM4IF_POSITION                    0x00000001
#define _IFS6_PWM4IF_MASK                        0x00000002
#define _IFS6_PWM4IF_LENGTH                      0x00000001

#define _IFS6_PWM5IF_POSITION                    0x00000002
#define _IFS6_PWM5IF_MASK                        0x00000004
#define _IFS6_PWM5IF_LENGTH                      0x00000001

#define _IFS6_PWM6IF_POSITION                    0x00000003
#define _IFS6_PWM6IF_MASK                        0x00000008
#define _IFS6_PWM6IF_LENGTH                      0x00000001

#define _IFS7_DMA8IF_POSITION                    0x00000006
#define _IFS7_DMA8IF_MASK                        0x00000040
#define _IFS7_DMA8IF_LENGTH                      0x00000001

#define _IFS7_DMA9IF_POSITION                    0x00000007
#define _IFS7_DMA9IF_MASK                        0x00000080
#define _IFS7_DMA9IF_LENGTH                      0x00000001

#define _IFS7_DMA10IF_POSITION                   0x00000008
#define _IFS7_DMA10IF_MASK                       0x00000100
#define _IFS7_DMA10IF_LENGTH                     0x00000001

#define _IFS7_DMA11IF_POSITION                   0x00000009
#define _IFS7_DMA11IF_MASK                       0x00000200
#define _IFS7_DMA11IF_LENGTH                     0x00000001

#define _IFS7_SPI4EIF_POSITION                   0x0000000A
#define _IFS7_SPI4EIF_MASK                       0x00000400
#define _IFS7_SPI4EIF_LENGTH                     0x00000001

#define _IFS7_SPI4IF_POSITION                    0x0000000B
#define _IFS7_SPI4IF_MASK                        0x00000800
#define _IFS7_SPI4IF_LENGTH                      0x00000001

#define _IFS7_OC10IF_POSITION                    0x0000000C
#define _IFS7_OC10IF_MASK                        0x00001000
#define _IFS7_OC10IF_LENGTH                      0x00000001

#define _IFS7_IC10IF_POSITION                    0x0000000D
#define _IFS7_IC10IF_MASK                        0x00002000
#define _IFS7_IC10IF_LENGTH                      0x00000001

#define _IFS7_OC11IF_POSITION                    0x0000000E
#define _IFS7_OC11IF_MASK                        0x00004000
#define _IFS7_OC11IF_LENGTH                      0x00000001

#define _IFS7_IC11IF_POSITION                    0x0000000F
#define _IFS7_IC11IF_MASK                        0x00008000
#define _IFS7_IC11IF_LENGTH                      0x00000001

#define _IFS8_OC12IF_POSITION                    0x00000000
#define _IFS8_OC12IF_MASK                        0x00000001
#define _IFS8_OC12IF_LENGTH                      0x00000001

#define _IFS8_IC12IF_POSITION                    0x00000001
#define _IFS8_IC12IF_MASK                        0x00000002
#define _IFS8_IC12IF_LENGTH                      0x00000001

#define _IFS8_DMA12IF_POSITION                   0x00000002
#define _IFS8_DMA12IF_MASK                       0x00000004
#define _IFS8_DMA12IF_LENGTH                     0x00000001

#define _IFS8_DMA13IF_POSITION                   0x00000003
#define _IFS8_DMA13IF_MASK                       0x00000008
#define _IFS8_DMA13IF_LENGTH                     0x00000001

#define _IFS8_DMA14IF_POSITION                   0x00000004
#define _IFS8_DMA14IF_MASK                       0x00000010
#define _IFS8_DMA14IF_LENGTH                     0x00000001

#define _IFS8_OC13IF_POSITION                    0x00000006
#define _IFS8_OC13IF_MASK                        0x00000040
#define _IFS8_OC13IF_LENGTH                      0x00000001

#define _IFS8_IC13IF_POSITION                    0x00000007
#define _IFS8_IC13IF_MASK                        0x00000080
#define _IFS8_IC13IF_LENGTH                      0x00000001

#define _IFS8_OC14IF_POSITION                    0x00000008
#define _IFS8_OC14IF_MASK                        0x00000100
#define _IFS8_OC14IF_LENGTH                      0x00000001

#define _IFS8_IC14IF_POSITION                    0x00000009
#define _IFS8_IC14IF_MASK                        0x00000200
#define _IFS8_IC14IF_LENGTH                      0x00000001

