MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512MU810/mcu.h
#define _DMA13REQ_IRQSEL7_POSITION               0x00000007
#define _DMA13REQ_IRQSEL7_MASK                   0x00000080
#define _DMA13REQ_IRQSEL7_LENGTH                 0x00000001

#define _DMA13STAH_STA_POSITION                  0x00000000
#define _DMA13STAH_STA_MASK                      0x000000FF
#define _DMA13STAH_STA_LENGTH                    0x00000008

#define _DMA13STBH_STB_POSITION                  0x00000000
#define _DMA13STBH_STB_MASK                      0x000000FF
#define _DMA13STBH_STB_LENGTH                    0x00000008

#define _DMA13CNT_CNT_POSITION                   0x00000000
#define _DMA13CNT_CNT_MASK                       0x00003FFF
#define _DMA13CNT_CNT_LENGTH                     0x0000000E

#define _DMA14CON_MODE_POSITION                  0x00000000
#define _DMA14CON_MODE_MASK                      0x00000003
#define _DMA14CON_MODE_LENGTH                    0x00000002

#define _DMA14CON_AMODE_POSITION                 0x00000004
#define _DMA14CON_AMODE_MASK                     0x00000030
#define _DMA14CON_AMODE_LENGTH                   0x00000002

#define _DMA14CON_NULLW_POSITION                 0x0000000B
#define _DMA14CON_NULLW_MASK                     0x00000800
#define _DMA14CON_NULLW_LENGTH                   0x00000001

#define _DMA14CON_HALF_POSITION                  0x0000000C
#define _DMA14CON_HALF_MASK                      0x00001000
#define _DMA14CON_HALF_LENGTH                    0x00000001

#define _DMA14CON_DIR_POSITION                   0x0000000D
#define _DMA14CON_DIR_MASK                       0x00002000
#define _DMA14CON_DIR_LENGTH                     0x00000001

#define _DMA14CON_SIZE_POSITION                  0x0000000E
#define _DMA14CON_SIZE_MASK                      0x00004000
#define _DMA14CON_SIZE_LENGTH                    0x00000001

#define _DMA14CON_CHEN_POSITION                  0x0000000F
#define _DMA14CON_CHEN_MASK                      0x00008000
#define _DMA14CON_CHEN_LENGTH                    0x00000001

#define _DMA14CON_MODE0_POSITION                 0x00000000
#define _DMA14CON_MODE0_MASK                     0x00000001
#define _DMA14CON_MODE0_LENGTH                   0x00000001

#define _DMA14CON_MODE1_POSITION                 0x00000001
#define _DMA14CON_MODE1_MASK                     0x00000002
#define _DMA14CON_MODE1_LENGTH                   0x00000001

#define _DMA14CON_AMODE0_POSITION                0x00000004
#define _DMA14CON_AMODE0_MASK                    0x00000010
#define _DMA14CON_AMODE0_LENGTH                  0x00000001

#define _DMA14CON_AMODE1_POSITION                0x00000005
#define _DMA14CON_AMODE1_MASK                    0x00000020
#define _DMA14CON_AMODE1_LENGTH                  0x00000001

#define _DMA14REQ_IRQSEL_POSITION                0x00000000
#define _DMA14REQ_IRQSEL_MASK                    0x000000FF
#define _DMA14REQ_IRQSEL_LENGTH                  0x00000008

#define _DMA14REQ_FORCE_POSITION                 0x0000000F
#define _DMA14REQ_FORCE_MASK                     0x00008000
#define _DMA14REQ_FORCE_LENGTH                   0x00000001

#define _DMA14REQ_IRQSEL0_POSITION               0x00000000
#define _DMA14REQ_IRQSEL0_MASK                   0x00000001
#define _DMA14REQ_IRQSEL0_LENGTH                 0x00000001

#define _DMA14REQ_IRQSEL1_POSITION               0x00000001
#define _DMA14REQ_IRQSEL1_MASK                   0x00000002
#define _DMA14REQ_IRQSEL1_LENGTH                 0x00000001

#define _DMA14REQ_IRQSEL2_POSITION               0x00000002
#define _DMA14REQ_IRQSEL2_MASK                   0x00000004
#define _DMA14REQ_IRQSEL2_LENGTH                 0x00000001

#define _DMA14REQ_IRQSEL3_POSITION               0x00000003
#define _DMA14REQ_IRQSEL3_MASK                   0x00000008
#define _DMA14REQ_IRQSEL3_LENGTH                 0x00000001

#define _DMA14REQ_IRQSEL4_POSITION               0x00000004
#define _DMA14REQ_IRQSEL4_MASK                   0x00000010
#define _DMA14REQ_IRQSEL4_LENGTH                 0x00000001

#define _DMA14REQ_IRQSEL5_POSITION               0x00000005
#define _DMA14REQ_IRQSEL5_MASK                   0x00000020
#define _DMA14REQ_IRQSEL5_LENGTH                 0x00000001

#define _DMA14REQ_IRQSEL6_POSITION               0x00000006
#define _DMA14REQ_IRQSEL6_MASK                   0x00000040
#define _DMA14REQ_IRQSEL6_LENGTH                 0x00000001

#define _DMA14REQ_IRQSEL7_POSITION               0x00000007
#define _DMA14REQ_IRQSEL7_MASK                   0x00000080
#define _DMA14REQ_IRQSEL7_LENGTH                 0x00000001

#define _DMA14STAH_STA_POSITION                  0x00000000
#define _DMA14STAH_STA_MASK                      0x000000FF
#define _DMA14STAH_STA_LENGTH                    0x00000008

#define _DMA14STBH_STB_POSITION                  0x00000000
#define _DMA14STBH_STB_MASK                      0x000000FF
#define _DMA14STBH_STB_LENGTH                    0x00000008

#define _DMA14CNT_CNT_POSITION                   0x00000000
#define _DMA14CNT_CNT_MASK                       0x00003FFF
#define _DMA14CNT_CNT_LENGTH                     0x0000000E

#define _DMAPWC_PWCOL0_POSITION                  0x00000000
#define _DMAPWC_PWCOL0_MASK                      0x00000001
#define _DMAPWC_PWCOL0_LENGTH                    0x00000001

#define _DMAPWC_PWCOL1_POSITION                  0x00000001
#define _DMAPWC_PWCOL1_MASK                      0x00000002
#define _DMAPWC_PWCOL1_LENGTH                    0x00000001

#define _DMAPWC_PWCOL2_POSITION                  0x00000002
#define _DMAPWC_PWCOL2_MASK                      0x00000004
#define _DMAPWC_PWCOL2_LENGTH                    0x00000001

#define _DMAPWC_PWCOL3_POSITION                  0x00000003
#define _DMAPWC_PWCOL3_MASK                      0x00000008
#define _DMAPWC_PWCOL3_LENGTH                    0x00000001

#define _DMAPWC_PWCOL4_POSITION                  0x00000004
#define _DMAPWC_PWCOL4_MASK                      0x00000010
#define _DMAPWC_PWCOL4_LENGTH                    0x00000001

#define _DMAPWC_PWCOL5_POSITION                  0x00000005
#define _DMAPWC_PWCOL5_MASK                      0x00000020
#define _DMAPWC_PWCOL5_LENGTH                    0x00000001

#define _DMAPWC_PWCOL6_POSITION                  0x00000006
#define _DMAPWC_PWCOL6_MASK                      0x00000040
#define _DMAPWC_PWCOL6_LENGTH                    0x00000001

#define _DMAPWC_PWCOL7_POSITION                  0x00000007
#define _DMAPWC_PWCOL7_MASK                      0x00000080
#define _DMAPWC_PWCOL7_LENGTH                    0x00000001

